application/modules/Custom/Interbrain/Perfect2/requestB.xml

<?xml version="1.0" encoding="UTF-8"?> 
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ns1="http://interbrain.p2online/" xmlns:enc="http://www.w3.org/2003/05/soap-encoding"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
    <env:Body>
        <ns1:ValidateOrder/>
        <param1>
            <Items>
                <SOAP-ENC:Struct>
                    <Id>1</Id>
                    <Client>
                        <Typ>2</Typ>
                        <EMailAddress>a.kummer@wdrei.ch</EMailAddress>
                    </Client>
                    <ItemID>GU00000000010000000002</ItemID>
                    <ItemLanguage>SD</ItemLanguage>
                    <Quantity>1</Quantity>
                </SOAP-ENC:Struct>
                <SOAP-ENC:Struct>
                    <Id>2</Id>
                    <Client>
                        <Typ>2</Typ>
                        <EMailAddress>a.kummer@wdrei.ch</EMailAddress>
                    </Client>
                    <ItemID>GU00000000010000000003</ItemID>
                    <ItemLanguage>SD</ItemLanguage>
                    <Quantity>1</Quantity>
                </SOAP-ENC:Struct>
            </Items>
        </param1>
    </env:Body>
</env:Envelope>
